FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_Timer.c
    // Set the actions on the match
    r->iMCR &= ~(7 << (aMatchRegister * 3));
    r->iMCR |= (aFlags << (aMatchRegister * 3));

    // Change the match register
    r->iMR[aMatchRegister] = aMatchPoint / (PROCESSOR_OSCILLATOR_FREQUENCY
        / PCLK_FREQUENCY);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Internal Information tables:
 *---------------------------------------------------------------------------*/
static const T_LPC17xx_40xx_Timer_Info G_Timer0_Info = {
        TIMER0_IRQn,
        (TISRFPtr)Timer0_ISR,
        "Timer0",
        1, };

static const T_LPC17xx_40xx_Timer_Info G_Timer1_Info = {
        TIMER1_IRQn,
        (TISRFPtr)Timer1_ISR,
        "Timer1",
        2, };

static const T_LPC17xx_40xx_Timer_Info G_Timer2_Info = {
        TIMER2_IRQn,
        (TISRFPtr)Timer2_ISR,
        "Timer2",
        22, };

static const T_LPC17xx_40xx_Timer_Info G_Timer3_Info = {
        TIMER3_IRQn,
        (TISRFPtr)Timer3_ISR,
        "Timer3",
        23, };

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_Timer LPC17xx_40xx_Timer0_Interface = {
    {
    "NXP:LPC17xx_40xx:Timer0",
    0x0100,
    LPC17xx_40xx_Timer0_InitializeWorkspace,
    sizeof(T_LPC17xx_40xx_Timer_Workspace),
    },

    LPC17xx_40xx_Timer_SetTimerMode,
    LPC17xx_40xx_Timer_SetCaptureSource,
    LPC17xx_40xx_Timer_SetMatchRegister,
    LPC17xx_40xx_Timer_SetExternalControl,
    LPC17xx_40xx_Timer_Reset,
    LPC17xx_40xx_Timer_Enable,
    LPC17xx_40xx_Timer_Disable,
    LPC17xx_40xx_Timer_SetMatchCallback,
    LPC17xx_40xx_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC17xx_40xx_Timer1_Interface = {
    {
    "NXP:LPC17xx_40xx:Timer1",
    0x0100,
    LPC17xx_40xx_Timer1_InitializeWorkspace,
    sizeof(T_LPC17xx_40xx_Timer_Workspace),
    },

    LPC17xx_40xx_Timer_SetTimerMode,
    LPC17xx_40xx_Timer_SetCaptureSource,
    LPC17xx_40xx_Timer_SetMatchRegister,
    LPC17xx_40xx_Timer_SetExternalControl,
    LPC17xx_40xx_Timer_Reset,
    LPC17xx_40xx_Timer_Enable,
    LPC17xx_40xx_Timer_Disable,
    LPC17xx_40xx_Timer_SetMatchCallback,
    LPC17xx_40xx_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC17xx_40xx_Timer2_Interface = {
    {
    "NXP:LPC17xx_40xx:Timer2",
    0x0100,
    LPC17xx_40xx_Timer2_InitializeWorkspace,
    sizeof(T_LPC17xx_40xx_Timer_Workspace),
    },

    LPC17xx_40xx_Timer_SetTimerMode,
    LPC17xx_40xx_Timer_SetCaptureSource,
    LPC17xx_40xx_Timer_SetMatchRegister,
    LPC17xx_40xx_Timer_SetExternalControl,
    LPC17xx_40xx_Timer_Reset,
    LPC17xx_40xx_Timer_Enable,
    LPC17xx_40xx_Timer_Disable,
    LPC17xx_40xx_Timer_SetMatchCallback,
    LPC17xx_40xx_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC17xx_40xx_Timer3_Interface = {
    {
    "NXP:LPC17xx_40xx:Timer3",
    0x0100,
    LPC17xx_40xx_Timer3_InitializeWorkspace,
    sizeof(T_LPC17xx_40xx_Timer_Workspace),
    },

    LPC17xx_40xx_Timer_SetTimerMode,
    LPC17xx_40xx_Timer_SetCaptureSource,
    LPC17xx_40xx_Timer_SetMatchRegister,
    LPC17xx_40xx_Timer_SetExternalControl,
    LPC17xx_40xx_Timer_Reset,
    LPC17xx_40xx_Timer_Enable,
    LPC17xx_40xx_Timer_Disable,
    LPC17xx_40xx_Timer_SetMatchCallback,
    LPC17xx_40xx_Timer_SetMatchRegisterFunctions,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC17xx_40xx_Timer0_Require(const T_LPC17xx_40xx_Timer_Settings *aSettings)
{
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P1_26, IOCON_D_DEFAULT(3)}, // T0_CAP0
            {GPIO_P3_23, IOCON_D_DEFAULT(3)}, // T0_CAP0
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P1_27, IOCON_D_DEFAULT(3)}, // T0_CAP1
            {GPIO_P3_24, IOCON_D_DEFAULT(3)}, // T0_CAP1
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P1_28, IOCON_D_DEFAULT(3)}, // T0_MAT0
            {GPIO_P3_25, IOCON_D_DEFAULT(3)}, // T0_MAT0
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P1_29, IOCON_D_DEFAULT(3)}, // T0_MAT1
            {GPIO_P3_26, IOCON_D_DEFAULT(3)}, // T0_MAT0
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer0
    HALInterfaceRegister("Timer0", (T_halInterface *)&LPC17xx_40xx_Timer0_Interface,
            0, 0);
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iMAT[2], 0, 0);
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iMAT[3], 0, 0);
}

void LPC17xx_40xx_Timer1_Require(const T_LPC17xx_40xx_Timer_Settings *aSettings)
{
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P1_18, IOCON_D_DEFAULT(3)}, // T1_CAP0
            {GPIO_P3_27, IOCON_D_DEFAULT(3)}, // T1_CAP0
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P1_19, IOCON_D_DEFAULT(3)}, // T1_CAP1
            {GPIO_P3_28, IOCON_D_DEFAULT(3)}, // T1_CAP1
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P1_22, IOCON_D_DEFAULT(3)}, // T1_MAT0
            {GPIO_P3_29, IOCON_D_DEFAULT(3)}, // T1_MAT0
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P1_25, IOCON_D_DEFAULT(3)}, // T1_MAT1
            {GPIO_P3_30, IOCON_D_DEFAULT(3)}, // T1_MAT1
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsMAT2[] = {
            {GPIO_P3_31, IOCON_D_DEFAULT(3)}, // T1_MAT2
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer1
    HALInterfaceRegister("Timer1", (T_halInterface *)&LPC17xx_40xx_Timer1_Interface,
            0, 0);
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT2,
            ARRAY_COUNT(pinsMAT2));
    LPC17xx_40xx_IOCON_ConfigPinOrNone(aSettings->iMAT[3], 0, 0);
}

